<?
if(!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die();
if(!CModule::IncludeModule("silta_framework"))                  return ShowError("module silta_framework required!");
/*
ПЕРЕДАВАЕМЫЕ ПАРАМЕТРЫ

VALUE      - значение
TITLE      - титул
CHECKED    - отмечен Y/N

INPUT_NAME - имя поля
ATTR       - аттрибуты
*/
/* -------------------------------------------------------------------- */
/* -------------------------- корректировки --------------------------- */
/* -------------------------------------------------------------------- */
$checked = false;
if($arParams["CHECKED"] == 'Y') $checked = true;
/* -------------------------------------------------------------------- */
/* ----------------------- параметры для шаблона ---------------------- */
/* -------------------------------------------------------------------- */
$arResult =
	[
	"value"      => $arParams["VALUE"],
	"title"      => $arParams["TITLE"],
	"checked"    => $checked,

	"input_name" => $arParams["INPUT_NAME"],
	"attr"       => $arParams["ATTR"]
	];
/* -------------------------------------------------------------------- */
/* ------------------------------- вывод ------------------------------ */
/* -------------------------------------------------------------------- */
$this->IncludeComponentTemplate(); 
?>