
<?
final class SexchangeIETEST extends SexchangeImportElement
{
/* -------------------------------------------------------------------- */
/* ------------------ преобразовать полученные данные ----------------- */
/* -------------------------------------------------------------------- */
protected function ConvertValue(array $params = [], array $valueArray = [])
{
return $valueArray;
}
/* -------------------------------------------------------------------- */
/* ------------------- работа с полученными данными ------------------- */
/* -------------------------------------------------------------------- */
protected function ExchangeOperation(array $params = [], array $valueArray = [])
{

}
}
?>