<?
if(!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die();
if(!CModule::IncludeModule("silta_diy_module"))                 return ShowError("modules required: silta_diy_module");
/*
ПЕРЕДАВАЕМЫЕ ПАРАМЕТРЫ

WORK_TABLE - рабочая таблица
LINK       - базовая ссылка
*/
if(!$arParams["LINK"]) return;
/* -------------------------------------------------------------------- */
/* ---------------------------- переменные ---------------------------- */
/* -------------------------------------------------------------------- */
$tableObject = SDiyModule::GetInstance()->GetTable($arParams["WORK_TABLE"]); // объект таблицы
if(!$tableObject->GetAccess("create_element")) return;
/* -------------------------------------------------------------------- */
/* ----------------------- параметры для шаблона ---------------------- */
/* -------------------------------------------------------------------- */
$arResult =
	[
	"table" => ToUpper($arParams["WORK_TABLE"]), // имя таблицы
	"link"  => $arParams["LINK"]                 // ссылка на страницу создания элемента
	];
/* -------------------------------------------------------------------- */
/* ------------------------------- вывод ------------------------------ */
/* -------------------------------------------------------------------- */
$this->IncludeComponentTemplate();
?>