<?
if(!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die();
if(!CModule::IncludeModule("silta_framework"))                  return ShowError("module silta_framework required!");
/*
ПЕРЕДАВАЕМЫЕ ПАРАМЕТРЫ

VALUE       - значение
INPUT_NAME  - имя поля

PLACEHOLDER - подсказка
SIZE        - размер поля
ATTR        - аттрибуты
*/
/* -------------------------------------------------------------------- */
/* -------------------------- корректировки --------------------------- */
/* -------------------------------------------------------------------- */
if(!$arParams["SIZE"]) $arParams["SIZE"] = '10';
/* -------------------------------------------------------------------- */
/* ----------------------- параметры для шаблона ---------------------- */
/* -------------------------------------------------------------------- */
$arResult =
	[
	"value"       => $arParams["VALUE"],
	"input_name"  => $arParams["INPUT_NAME"],

	"placeholder" => $arParams["PLACEHOLDER"],
	"size"        => $arParams["SIZE"],
	"attr"        => $arParams["ATTR"]
	];
/* -------------------------------------------------------------------- */
/* ------------------------------- вывод ------------------------------ */
/* -------------------------------------------------------------------- */
$this->IncludeComponentTemplate(); 
?>