<?
if(!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die();
if(!CModule::IncludeModule("silta_framework"))                  return ShowError("module silta_framework required!");
/*
ПЕРЕДАВАЕМЫЕ ПАРАМЕТРЫ

VALUE       - значение
INPUT_NAME  - имя поля

ATTR        - аттрибуты
PLACEHOLDER - текст-подсказка
SIZE        - длинна поля
MASK        - маска
*/
/* -------------------------------------------------------------------- */
/* -------------------------- корректировки --------------------------- */
/* -------------------------------------------------------------------- */
if(!$arParams["SIZE"]) $arParams["SIZE"] = '35';
/* -------------------------------------------------------------------- */
/* ----------------------- параметры для шаблона ---------------------- */
/* -------------------------------------------------------------------- */
$arResult =
	[
	"value"       => $arParams["VALUE"],
	"input_name"  => $arParams["INPUT_NAME"],

	"attr"        => $arParams["ATTR"],
	"placeholder" => $arParams["PLACEHOLDER"],
	"size"        => $arParams["SIZE"],
	"mask"        => $arParams["MASK"]
	];
/* -------------------------------------------------------------------- */
/* ------------------------------- вывод ------------------------------ */
/* -------------------------------------------------------------------- */
$this->IncludeComponentTemplate(); 
?>