<?
if(!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die();
if(!CModule::IncludeModule("silta_framework"))                  return ShowError("module silta_framework required!");
/*
ПЕРЕДАВАЕМЫЕ ПАРАМЕТРЫ

VALUE      - значение
INPUT_NAME - имя поля

DATE       - использовать дату Y/N
TIME       - использовать время Y/N
START_DATE - стартовая дата

ATTR       - аттрибуты
*/
/* -------------------------------------------------------------------- */
/* -------------------------- корректировки --------------------------- */
/* -------------------------------------------------------------------- */
if(!in_array($arParams["DATE"], ["Y", "N"])) $arParams["DATE"] = 'Y';
if(!in_array($arParams["TIME"], ["Y", "N"])) $arParams["TIME"] = 'N';
/* -------------------------------------------------------------------- */
/* ----------------------- параметры для шаблона ---------------------- */
/* -------------------------------------------------------------------- */
$arResult =
	[
	"value"      => $arParams["VALUE"],
	"input_name" => $arParams["INPUT_NAME"],

	"date"       => $arParams["DATE"],
	"time"       => $arParams["TIME"],
	"start_date" => $arParams["START_DATE"],

	"attr"       => $arParams["ATTR"]
	];
/* -------------------------------------------------------------------- */
/* ------------------------------- вывод ------------------------------ */
/* -------------------------------------------------------------------- */
$this->IncludeComponentTemplate(); 
?>